[{"id":"kieowd_pillbug","source":"IPS-N","license_level":2,"name":"PILLBUG","mechtype":["Striker","Controller"],"description":"<p><em>This variant of the Nelson can be taken at rank II of the NELSON license instead of the base Frame, or gained as exotic gear through play.</em></p><p><em>The KIE-OWD Pillbug originally started life as an up-armored Nelson variant, replacing the armor plating with a malleable deterrence field, a thought experiment by Rubbleborn engineers to find novel methods in combating pirate boarding parties. Originally just theoretical, an intercepted shipment from a nearby mining colony would see the Rubbleborn there utilize the Pillbug in combat, where it proved to be a promising design.</em></p><p><em>Following negotiations with the mining colony, the newly-founded Off-World Division (OWD) of KIE decided to start collaborating with other manufacturers. In a show of good faith, the Pillbug’s schematics were sent to IPS-N proper. Following collaborative refinements, including an outside-of-the-box repurposing of the Nelson’s null-k plating and perpetual motion drive to be focused on what was around the mech, rather than what was inside of it.</em></p>","mounts":["Main/Aux","Flex"],"stats":{"size":1,"structure":4,"stress":4,"armor":"1","hp":"8","evasion":"10","edef":6,"heatcap":"7","repcap":"4","sensor_range":"3","tech_attack":"-2","save":"11","speed":"5","sp":6},"traits":[{"name":"All-Terrain Segmented Chitin ","use":"","description":"<p>Gain the Roll Up Quick Action</p>","actions":[{"name":"Roll Up","activation":"Quick","detail":"<p>The pillbug can roll up as a quick action. While rolled up:</p><ul><li><p>It becomes immune to the Slowed condition, but it becomes unable to make ranged or tech attacks</p></li><li><p>All knockback it deals or takes is increased by 1</p></li><li><p>It gains 2 + Grit Overshield</p></li></ul><p>It remains rolled up until it loses the Overshield, or until it unrolls as a protocol.</p><p><br></p>","cost":0,"pilot":false,"damage":[],"range":[],"synergy_locations":[],"tech_attack":false,"frequency":"Unlimited","init":"","trigger":""},{"name":"Unroll","activation":"Protocol","detail":"<p>Unroll, losing all Overshield granted by this trait.</p>","cost":0,"pilot":false,"damage":[],"range":[],"synergy_locations":[],"tech_attack":false,"frequency":"Unlimited","init":"","trigger":""}],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Explosive Impact","use":"","description":"<p>If the Pillbug moves at least 5 spaces in a straight line before hitting a character with a melee attack, it may Ram them as a free action immediately after the attack, but before any knockback is resolved. On hit, this Ram deals 1d6 explosive damage and knocks the target away 1 additional space.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["ram"],"detail":"<p>If the Pillbug moves at least 5 spaces in a straight line before hitting a character with a melee attack, it may Ram them as a free action immediately after the attack, but before any knockback is resolved. On hit, this Ram deals 1d6 explosive damage and knocks the target away 1 additional space.</p>","weapon_types":[],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]}],"core_system":{"name":"NULL-K REDIRECTION ENGINE","active_name":"Crash Landing","active_effect":"<p>This System quickly builds up speed in place for the Pillbug to perform a mighty jump before crashing down. Unless Immobilized, you jump to a space within range 10, ignoring reactions, engagement and creating a tremor in a burst 2 zone when you land. </p><p>Objects and pieces of terrain in the affected area take 30 AP kinetic damage, and the area becomes difficult terrain until the end of the scene. Characters in the affected area must make an Agility save or fall prone, and a Hull save, taking 2d6 kinetic damage on a fail, or half as much damage on a success. </p><p>You then can jump up to another point within range 10, ignoring reactions and engagement, as the force of impact makes you bounce away. You can Roll Up as a part of this action.</p>","activation":"Full","description":"<p><em>This simple system allows the Pillbug to generate more power on the move thanks to a set of modified servos that grant the joints incredible flexibility while in ambulatory mode, and help dissipate impacts along the shell’s surface while rolled up.</em></p>","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"","passive_effect":"","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"","y_pos":0},{"id":"kieowd_blackcarpet","source":"SSC","license_level":2,"name":"BLACK CARPET","mechtype":["Striker"],"description":"<p><em>This variant of the Mourning Cloak can be taken at rank II of the MOURNING CLOAK license instead of the base Frame, or gained as exotic gear through play.</em></p><p><em>Thanks to a massive bounty paid to first generation Rubblefolk lancers, a deal was struck with high level SSC manufacturers which, in exchange for exotic underground materials, were glad to add KIE-OWD to their licensed, 3rd-party designers. The pristine frames sent to Rubble as reference models ended up scrapped or covered with sandstorm dust; their flexible plating, cloaking devices and fine blades finding use with the more reserved members of the colony.</em></p><p><em>The Black Carpet is merely a name given to the groups that make scouting efforts of the massive tunnel systems, fending off invasive megafauna with concealed skirmishes that might last days at a time, as they take out the pack leaders before picking off each individual until none are left and the tunnels are secure again.</em></p>","mounts":["Main/Aux","Flex"],"stats":{"size":1,"structure":4,"stress":4,"armor":0,"hp":"8","evasion":"10","edef":"7","heatcap":"5","repcap":"3","sensor_range":10,"tech_attack":0,"save":"10","speed":"5","sp":6},"traits":[{"name":"Ambush Hunter","use":"","description":"<p>1/round, the Black Carpet may reroll a melee attack if the target has no adjacent characters or if the Black carpet is the only adjacent character. It must use the second result.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["weapon"],"detail":"<p>1/round, the Black Carpet may reroll a melee attack if the target has no adjacent characters or if the Black carpet is the only adjacent character. It must use the second result.</p>","weapon_types":["Melee"],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]},{"name":"Horrifying Apparition","use":"","description":"<p>When the Black Carpet loses Invisible or Hidden, it can force any adjacent characters to make a System save or become Jammed until the end of their next turn. A character can only become Jammed by this effect 1/scene. </p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"Phantasm Cloak","active_name":"Ethereal Meld","active_effect":"<p>The Black Carpet redirects all power towards a blinkspace engine, entering an ethereal state that makes it seem as a sentient shadow with no origin. </p><p>While in this state, you gain the following benefits: </p><ul><li><p> You become Invisible</p></li><li><p> Characters beyond range 5 cannot draw line of sight to the Black Carpet, their sensors simply showing emptiness where you stand.</p></li></ul><p>This state ends when you hit a character with an attack or force them to make a save.</p><p>This action is <strong>Efficient</strong>, and refunds 1 Core Power at the end of any scene in which it’s used.</p>","activation":"Protocol","description":"","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"Mark for Execution","passive_effect":"","passive_actions":[{"name":"Mark for Execution","activation":"Quick","detail":"<p>Choose a character within sensor range, forcing them to make a System save. On a fail, they become Marked for Execution, causing your next melee attack to gain the next effect:</p><ul><li><p>On Crit: You deal +1d6 bonus damage, and if you were Hidden, you may choose to stay Hidden and move up to your speed while ignoring reactions and engagement.</p></li></ul>","cost":0,"pilot":false,"damage":[],"range":[],"synergy_locations":[],"tech_attack":false,"frequency":"Unlimited","init":"","trigger":""}],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"","y_pos":0},{"id":"kieowd_cicada","source":"HORUS","license_level":2,"name":"CICADA","mechtype":["Striker","Controller"],"description":"<p><em>This variant of the Balor can be taken at rank II of the BALOR license instead of the base Frame, or gained as exotic gear through play.</em></p><p><em>Named after the notoriously noisy beetle species from Cradle, the Cicada was originally developed by a sect of Rubbleborn that decided to worship the Maker. Locating a cave of “time crystals”, they attempted to figure out how to travel back in time to prevent the destruction of their “deity”.&nbsp;</em></p><p><em>Constantly surrounded by rogue nanites, the Cicadas are a constant pain in the back of the more pacific colonies like Rubble, and although direct conflict in these zones are rare, their pillaging attacks against Weevil harvests are always a looming threat that forces such groups to keep their guard up at all times. Still, some of these individuals have found peace in their minds, thanks to additional sub-minds installed on their frames to control the mass of nanites. These “rehabilitated” Cicadas enjoy normal lives within the colonies, usually delegated as Longhorn assistants, using their nanites to spread messages when the Hivemind is blocked or Jammed.</em></p>","mounts":["Flex","Heavy"],"stats":{"size":2,"structure":4,"stress":4,"armor":0,"hp":"8","evasion":"8","edef":"11","heatcap":"4","repcap":"3","sensor_range":"8","tech_attack":"1","save":"11","speed":"4","sp":"8"},"traits":[{"name":"Drone Replicator","use":null,"description":"<p>1/Scene, when the Cicada deploys a drone, it can deploy an additional copy of the drone without expending additional charges or actions. The Cicada can ignore the 1/Scene limit of this trait by taking 1d6 AP kinetic damage that cannot be reduced in any way; after doing so once, the damage taken when ignoring the limit increases to 1d6+4 for the rest of the scene.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["drone"],"detail":"<p>1/Scene, when the Cicada deploys a drone, it can deploy an additional copy of the drone without expending additional charges or actions. The Cicada can ignore the 1/Scene limit of this trait by taking 1d6 AP kinetic damage that cannot be reduced in any way; after doing so once, the damage taken when ignoring the limit increases to 1d6+4 for the rest of the scene.</p>"}],"integrated":[],"special_equipment":[]},{"name":"Shapeless","use":"","description":"<p>While the Cicada is not Jammed:</p><ul><li><p>All Critical hits scored against it become normal hits.</p></li><li><p>All ranged and melee attacks made against the Cicada suffer 1 Difficulty if they are not Cone, Line, Burst or Blast attacks.</p></li></ul>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"HARBINGER OF LOCUST","active_name":"WARSONG OF THE HIVE","active_effect":"<p>For the rest of the scene, Warrior’s Chant inflicts 3 heat regardless if the target is adjacent to you or one of your drones. </p><p>Additionally, characters that make this save receive +1 Difficulty if you or one of your drones (besides the one that triggered this effect) is within range 3 of them. Difficulty gained in this way stacks.</p>","activation":"Protocol","description":"","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"Warrior's Chant","passive_effect":"<p>Hostile characters that start their turn adjacent to the Cicada or one of its drones must make a System save. On a fail, they take 3 heat if they are adjacent to the Cicada, or 1 if they are adjacent to a drone.</p>","passive_actions":[],"passive_bonuses":[],"passive_synergies":[{"locations":["drone"],"detail":"<p>Hostile characters that start their turn adjacent to the Cicada or one of its drones must make a System save. On a fail, they take 3 heat if they are adjacent to the Cicada, or 1 if they are adjacent to a drone.</p>","weapon_types":[],"weapon_sizes":[],"system_types":["Drone"]}],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"","y_pos":0},{"id":"kieowd_metriini","source":"HA","license_level":2,"name":"METRIINI","mechtype":["Striker","Artillery"],"description":"<p><em>This variant of the Sherman can be taken at rank II of the SHERMAN license instead of the base Frame, or gained as exotic gear through play.</em></p><p><em>A familiar frame to the Rubblefolk, the Sherman has been tinkered with through and throughout most of the Rubblefolk’s history, even before their liberation from the Maker’s influence. Originally used as a pest-cleaning frame, the Metriini models were armed with shaped demolition charges, meant to cause controlled explosions to seal off dangerous tunnels or to deliver incendiary compounds through narrow openings without endangering the user and their companions, something the modified Genghis and Tokugawa models failed at.</em></p><p><em>The additional power of the reactor was redirected towards a progressive flight engine, to allow the frame to soar through the skies of Jovo and patrol the surrounding areas to fend off the megafauna.</em></p>","mounts":["Flex","Flex","Heavy"],"stats":{"size":1,"structure":4,"stress":4,"armor":"1","hp":10,"evasion":"8","edef":6,"heatcap":"8","repcap":"4","sensor_range":10,"tech_attack":"-2","save":"10","speed":4,"sp":"5"},"traits":[{"name":"Fusion Jet Engine","use":"","description":"<p>The Metriini can hover while in the Danger Zone. If the Metriini exits the danger zone, this benefit lasts until the end of its next turn, at which point it falls as normal.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["heat"],"detail":"<p>The Metriini can hover while in the Danger Zone. If the Metriini exits the danger zone, this benefit lasts until the end of its next turn, at which point it falls as normal.</p>","weapon_types":[],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]},{"name":"Clear Skies...","use":"","description":"<p>The Metriini’s Launcher and Cannon weapons gain +1 Accuracy on attacks against flying characters.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["weapon"],"detail":"<p>The Metriini’s Launcher and Cannon weapons gain +1 Accuracy on attacks against flying characters.</p>","weapon_types":["Cannon","Launcher"],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]},{"name":"...and Scorched Valleys","use":"","description":"<p>When the Metriini clears all Heat, its next Launcher or Cannon attack deals +1d6 bonus Burn on a critical hit. This effect does not stack</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["heat","weapon"],"detail":"<p>When the Metriini clears all Heat, its next Launcher or Cannon attack deals +1d6 bonus Burn on a critical hit. This effect does not stack</p>","weapon_types":["Launcher","Cannon"],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]}],"core_system":{"name":"SHAPED-DEMOLITION MK IX MOLTEN CORE","active_name":"Jovo's Solar Rain","active_effect":"<p>Your SD9 MOLTENCORE immediately gains 3 charges, up to a maximum of 4. Additionally, 1/round when you attack with the SD9 MOLTENCORE, you can turn a number of free spaces equal to the charges used for the attack into dangerous terrain that deals Energy damage, which last until the end of the scene.</p>","activation":"Protocol","description":"<p><em>It took the Rubblefok several prototypes and testing deployments to develop a functional payload system able to maneuver through the intricate tunnels of the Rubble. The MK 9 is not the latest of these designs but instead the most reliable of them, still requiring advanced calculations from the user to make accurate use of the deployed napalm.</em></p>","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"","passive_effect":"","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":["kieowd_moltencore"],"special_equipment":[],"tags":[]},"image_url":"","y_pos":0},{"id":"kieowd_bombardier","source":"HA","license_level":2,"name":"BOMBARDIER","mechtype":["Artillery","Controller"],"description":"<p>This variant of the Genghis can be taken at rank II of the GENGHIS license instead of the base Frame, or gained as exotic gear through play.</p><p>Utilizing and repurposing Harrison Armory technologies is familiar ground for the Rubbleborn. Following contact with the outside world and the enhancement of their already-established industrial base, the Rubbleborn decided to use existing frames as testbeds. The Bombardier came out of this program as a specialized mining tool, using corrosive acids to dissolve rock into a softer slag substance, which other machines could more easily drill and collect. It proved to be so effective that it soon became standard-issue for all mining operations run by the Rubbleborn, and several have made their way into the hands of the Jovo Extraction Conglomerate as a gesture of goodwill.</p>","mounts":[],"stats":{"size":2,"structure":4,"stress":4,"armor":"1","hp":"8","evasion":6,"edef":6,"heatcap":"10","repcap":"2","sensor_range":"15","tech_attack":"-2","save":"10","speed":"2","sp":"5"},"traits":[{"name":"Munitions Launcher","use":"","description":"<p>When the Bombardier makes a Blast, Burst, Cone or Line attack with a ranged weapon, it can choose to use them through the munitions launcher, applying the following effects:</p><ul><li><p>The attack gains +3 Range (even if it does not have Range)</p></li><li><p>The weapon gains both the Arcing and Ordnance attack for the attack</p></li><li><p>Cone and Line attacks may be made in a different direction instead of straight from the Bombardier, as long as it falls within the Range of the Munitions Launcher.</p></li></ul>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Walk over Embers","use":"","description":"<p>While in the Danger Zone, the Bombardier’s base speed increases to 4, and it becomes immune to both difficult and dangerous terrain.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[{"locations":["heat","move"],"detail":"<p>While in the Danger Zone, the Bombardier’s base speed increases to 4, and it becomes immune to both difficult and dangerous terrain.</p>","weapon_types":[],"weapon_sizes":[],"system_types":[]}],"integrated":[],"special_equipment":[]}],"core_system":{"name":"07/MCB CHEMICAL FURNACE","active_name":"Master Terraformer","active_effect":"<p>The Bombardier’s launcher systems are enhanced, and the safety limiters removed temporarily. For the rest of the scene:</p><ul><li><p>Acid zone placed by Corrosive Spray last until the end of the scene and now deal 5 Burn instead of 2.</p></li><li><p>Munition Launcher's base range is increased to 5.</p></li><li><p>Allied become immune to your Corrosive Spray.</p></li></ul>","activation":"Protocol","description":"","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"Corrosive Spray","passive_effect":"<p>1/round, when the Bombardier makes a blast, burst, cone or line attack, it can spray acid on a free space within the affected area, which becomes difficult terrain and deals 2 Burn to a character that starts their turn there or moves into the area for the first time in a round. </p><p>This spray lasts until the end of its next turn. For each critical hit it scores on such attacks, it can place an additional zone of acid.</p>","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"","y_pos":0}]